afrab/WSim/arch/atmega/atmega128_alu.c

/**
 *  \file   atmega128_alu.c
 *  \brief  Atmega128 MCU ALU emulation
 *  \author Antoine Fraboulet
 *  \date   2007
 **/

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <assert.h>

#include "arch/common/hardware.h"
#include "atmega128.h"

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

/**
 * global variables used in this file
 *
 *
 */ 

#define __DEBUG_ME_HARDER

#define BITS2(w,n) ((w >> n) & 3)

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#define BIT0 0x01
#define BIT1 0x02
#define BIT2 0x04
#define BIT3 0x08
#define BIT4 0x10
#define BIT5 0x20
#define BIT6 0x40
#define BIT7 0x80

#define BIT0_(v)   ((v >>  0) & 1)
#define BIT1_(v)   ((v >>  1) & 1)
#define BIT2_(v)   ((v >>  2) & 1)
#define BIT3_(v)   ((v >>  3) & 1)
#define BIT4_(v)   ((v >>  4) & 1)
#define BIT5_(v)   ((v >>  5) & 1)
#define BIT6_(v)   ((v >>  6) & 1)
#define BIT7_(v)   ((v >>  7) & 1)
#define BIT8_(v)   ((v >>  8) & 1)
#define BIT9_(v)   ((v >>  9) & 1)
#define BIT10_(v)  ((v >> 10) & 1)
#define BIT11_(v)  ((v >> 11) & 1)
#define BIT12_(v)  ((v >> 12) & 1)
#define BIT13_(v)  ((v >> 13) & 1)
#define BIT14_(v)  ((v >> 14) & 1)
#define BIT15_(v)  ((v >> 15) & 1)

/*
#define BIT0n(v)  !((v >> 0) & 1)
#define BIT1n(v)  !((v >> 1) & 1)
#define BIT2n(v)  !((v >> 2) & 1)
#define BIT3n(v)  !((v >> 3) & 1)
#define BIT4n(v)  !((v >> 4) & 1)
#define BIT5n(v)  !((v >> 5) & 1)
#define BIT6n(v)  !((v >> 6) & 1)
#define BIT7n(v)  !((v >> 7) & 1)
*/

#define BIT0n(v)   !BIT0_(v)
#define BIT1n(v)   !BIT1_(v)
#define BIT2n(v)   !BIT2_(v)
#define BIT3n(v)   !BIT3_(v)
#define BIT4n(v)   !BIT4_(v)
#define BIT5n(v)   !BIT5_(v)
#define BIT6n(v)   !BIT6_(v)
#define BIT7n(v)   !BIT7_(v)
#define BIT8n(v)   !BIT8_(v)
#define BIT9n(v)   !BIT9_(v)
#define BIT10n(v)  !BIT10_(v)
#define BIT11n(v)  !BIT11_(v)
#define BIT12n(v)  !BIT12_(v)
#define BIT13n(v)  !BIT13_(v)
#define BIT14n(v)  !BIT14_(v)
#define BIT15n(v)  !BIT15_(v)

/*
 *  SREG: Status Register
 *  C:    Carry Flag
 *  Z:    Zero Flag
 *  N:    Negative Flag
 *  V:    Two's complement overflow indicator
 *  S:    N xor V, For signed tests
 *  H:    Half Carry Flag
 *  T:    Transfer bit used by BLD and BST instructions
 *  I:    Global Interrupt Enable/Disable Flag
 */

#define SREG_I_BIT (1 << 7)
#define SREG_T_BIT (1 << 6)
#define SREG_H_BIT (1 << 5)
#define SREG_S_BIT (1 << 4)
#define SREG_V_BIT (1 << 3)
#define SREG_N_BIT (1 << 2)
#define SREG_Z_BIT (1 << 1)
#define SREG_C_BIT (1 << 0)

#define SET_I  SR |= SREG_I_BIT
#define SET_T  SR |= SREG_T_BIT
#define SET_H  SR |= SREG_H_BIT
#define SET_S  SR |= SREG_S_BIT
#define SET_V  SR |= SREG_V_BIT
#define SET_N  SR |= SREG_N_BIT
#define SET_Z  SR |= SREG_Z_BIT
#define SET_C  SR |= SREG_C_BIT

#define CLR_I  SR &= ~SREG_I_BIT
#define CLR_T  SR &= ~SREG_T_BIT
#define CLR_H  SR &= ~SREG_H_BIT
#define CLR_S  SR &= ~SREG_S_BIT
#define CLR_V  SR &= ~SREG_V_BIT
#define CLR_N  SR &= ~SREG_N_BIT
#define CLR_Z  SR &= ~SREG_Z_BIT
#define CLR_C  SR &= ~SREG_C_BIT

#define WRITE_I(b)   if (b) { SET_I; } else { CLR_I; }
#define WRITE_T(b)   if (b) { SET_T; } else { CLR_T; }
#define WRITE_H(b)   if (b) { SET_H; } else { CLR_H; }
#define WRITE_S(b)   if (b) { SET_S; } else { CLR_S; }
#define WRITE_V(b)   if (b) { SET_V; } else { CLR_V; }
#define WRITE_N(b)   if (b) { SET_N; } else { CLR_N; }
#define WRITE_Z(b)   if (b) { SET_Z; } else { CLR_Z; }
#define WRITE_C(b)   if (b) { SET_C; } else { CLR_C; }

#define READ_I ((uint16_t)((SR >> 7) & 1))
#define READ_T ((uint16_t)((SR >> 6) & 1))
#define READ_H ((uint16_t)((SR >> 5) & 1))
#define READ_S ((uint16_t)((SR >> 4) & 1))
#define READ_V ((uint16_t)((SR >> 3) & 1))
#define READ_N ((uint16_t)((SR >> 2) & 1))
#define READ_Z ((uint16_t)((SR >> 1) & 1))
#define READ_C ((uint16_t)((SR >> 0) & 1))


enum atmega_opcode {
  OP_ADD = 0,
  OP_ADC,
  OP_ADIW,
  OP_AND,
  OP_ANDI,
  OP_ASR,
  OP_BREAK,
  OP_SUB,
  OP_SUBI,
  OP_SBC,
  OP_SBCI,
  OP_SBIW,
  OP_OR,
  OP_ORI,
  OP_EOR,
  OP_COM,
  OP_NEG,
  OP_SBR,
  OP_CBR,
  OP_CLC,
  OP_CLH,
  OP_CLT,
  OP_CLI,
  OP_CLS,
  OP_CLV,
  OP_CLZ,
  OP_IN,
  OP_INC,
  OP_DEC,
  OP_TST,
  OP_CLR, /* == OP_EOR */
  OP_CLN,
  OP_SPM,
  OP_SEH,
  OP_SEN,
  OP_SER,
  OP_SEV,
  OP_SEZ,
  OP_SLEEP,
  OP_MUL,
  OP_MULS,
  OP_MULSU,
  OP_FMUL,
  OP_FMULS,
  OP_FMULSU,
  OP_RJMP,
  OP_IJMP,
  OP_EIJMP,
  OP_ELPM,
  OP_JMP,
  OP_RCALL,
  OP_ICALL,
  OP_EICALL,
  OP_CALL,
  OP_RET,
  OP_RETI,
  OP_CPSE,
  OP_CBI,
  OP_CP,
  OP_CPC,
  OP_CPI,
  OP_ROR,
  OP_SBRC,
  OP_SBRS,
  OP_SBIC,
  OP_SBIS,
  OP_BRBS,
  OP_BRBC,
  OP_BLD,
  OP_BST,
  OP_BREQ,
  OP_BRNE,
  OP_BRCS,
  OP_BRCC,
  OP_BRSH,
  OP_BRLO,
  OP_BRMI,
  OP_BRPL,
  OP_BRGE,
  OP_BRLT,
  OP_BRHS,
  OP_BRHC,
  OP_BRTS,
  OP_BRTC,
  OP_BRVS,
  OP_BRVC,
  OP_BRIE,
  OP_BRID,
  OP_MOV,
  OP_MOVW,
  OP_NOP,
  OP_LDI,
  OP_LDS,
  OP_LD,
  OP_LDD,
  OP_LPM,
  OP_LSR,
  OP_OUT,
  OP_POP,
  OP_PUSH,
  OP_SBI,
  OP_SEC,
  OP_SES,
  OP_SET,
  OP_SEI,
  OP_SR,
  OP_ST,
  OP_STD,
  OP_STS,
  OP_SWAP,
  OP_WDR
};

typedef int (*opcode_fun_t)(uint16_t opcode, uint16_t insn);
static int opcode_default(uint16_t opcode, uint16_t insn);

static int opcode_sleep  (uint16_t opcode, uint16_t insn);

static int opcode_or     (uint16_t opcode, uint16_t insn);
static int opcode_eor    (uint16_t opcode, uint16_t insn);
static int opcode_ori    (uint16_t opcode, uint16_t insn);
static int opcode_sbr    (uint16_t opcode, uint16_t insn);
static int opcode_and    (uint16_t opcode, uint16_t insn);
static int opcode_andi   (uint16_t opcode, uint16_t insn);
static int opcode_cbr    (uint16_t opcode, uint16_t insn);
static int opcode_com    (uint16_t opcode, uint16_t insn);
static int opcode_neg    (uint16_t opcode, uint16_t insn);

static int opcode_add    (uint16_t opcode, uint16_t insn);
static int opcode_adc    (uint16_t opcode, uint16_t insn);
static int opcode_adiw   (uint16_t opcode, uint16_t insn);

