afrab/WSim/arch/atmega/atmega128_alu.c
static int opcode_sub    (uint16_t opcode, uint16_t insn);
static int opcode_subi   (uint16_t opcode, uint16_t insn);
static int opcode_sbiw   (uint16_t opcode, uint16_t insn);
static int opcode_sbc    (uint16_t opcode, uint16_t insn);
static int opcode_sbci   (uint16_t opcode, uint16_t insn);

static int opcode_asr   (uint16_t opcode, uint16_t insn);

static int opcode_in     (uint16_t opcode, uint16_t insn);
static int opcode_out    (uint16_t opcode, uint16_t insn);
static int opcode_sbi    (uint16_t opcode, uint16_t insn);

static int opcode_cp     (uint16_t opcode, uint16_t insn);
static int opcode_cpi    (uint16_t opcode, uint16_t insn);
static int opcode_cpc    (uint16_t opcode, uint16_t insn);

static int opcode_sec    (uint16_t opcode, uint16_t insn);
static int opcode_seh    (uint16_t opcode, uint16_t insn);
static int opcode_set    (uint16_t opcode, uint16_t insn);
static int opcode_sei    (uint16_t opcode, uint16_t insn);
static int opcode_ses    (uint16_t opcode, uint16_t insn);
static int opcode_sev    (uint16_t opcode, uint16_t insn);
static int opcode_sez    (uint16_t opcode, uint16_t insn);
static int opcode_sen    (uint16_t opcode, uint16_t insn);

static int opcode_clc    (uint16_t opcode, uint16_t insn);
static int opcode_clh    (uint16_t opcode, uint16_t insn);
static int opcode_clt    (uint16_t opcode, uint16_t insn);
static int opcode_cli    (uint16_t opcode, uint16_t insn);
static int opcode_cls    (uint16_t opcode, uint16_t insn);
static int opcode_clv    (uint16_t opcode, uint16_t insn);
static int opcode_clz    (uint16_t opcode, uint16_t insn);
static int opcode_cln    (uint16_t opcode, uint16_t insn);

static int opcode_ser    (uint16_t opcode, uint16_t insn);

static int opcode_jmp    (uint16_t opcode, uint16_t insn);
static int opcode_rjmp   (uint16_t opcode, uint16_t insn);

static int opcode_call   (uint16_t opcode, uint16_t insn);
static int opcode_ret    (uint16_t opcode, uint16_t insn);

static int opcode_brne   (uint16_t opcode, uint16_t insn);
static int opcode_brcc   (uint16_t opcode, uint16_t insn);
static int opcode_breq   (uint16_t opcode, uint16_t insn);

static int opcode_mov    (uint16_t opcode, uint16_t insn);
static int opcode_movw   (uint16_t opcode, uint16_t insn);

static int opcode_st     (uint16_t opcode, uint16_t insn);
static int opcode_sts    (uint16_t opcode, uint16_t insn);
static int opcode_std    (uint16_t opcode, uint16_t insn);

static int opcode_elpm   (uint16_t opcode, uint16_t insn);
static int opcode_ld     (uint16_t opcode, uint16_t insn);
static int opcode_ldd    (uint16_t opcode, uint16_t insn);
static int opcode_ldi    (uint16_t opcode, uint16_t insn);

static int opcode_pop    (uint16_t opcode, uint16_t insn);
static int opcode_push   (uint16_t opcode, uint16_t insn);

struct atmega_opcode_info_t {
  opcode_fun_t   fun;
  char          *name;
};

struct atmega_opcode_info_t OPCODES[] = {
  { .fun = opcode_add,     .name = "ADD"    }, /* done: needs reviewing */
  { .fun = opcode_adc,     .name = "ADC"    }, /* done: needs reviewing */
  { .fun = opcode_adiw,    .name = "ADIW"   }, /* done: needs reviewing */
  { .fun = opcode_and,     .name = "AND"    },
  { .fun = opcode_andi,    .name = "ANDI"   }, /* done: needs reviewing */
  { .fun = opcode_asr,     .name = "ASR"    }, /* done: needs reviewing */
  { .fun = opcode_default, .name = "BREAK"  },
  { .fun = opcode_sub,     .name = "SUB"    },  /* done: needs reviewing */
  { .fun = opcode_subi,    .name = "SUBI"   },
  { .fun = opcode_sbc,     .name = "SBC"    }, /* done: needs reviewing */
  { .fun = opcode_sbci,    .name = "SBCI"   }, /* done: needs reviewing */
  { .fun = opcode_sbiw,    .name = "SBIW"   }, /* done: needs reviewing */
  { .fun = opcode_or,      .name = "OR"     }, /* done: needs reviewing */
  { .fun = opcode_ori,     .name = "ORI"    },
  { .fun = opcode_eor,     .name = "EOR"    },
  { .fun = opcode_com,     .name = "COM"    }, /* done: needs reviewing */
  { .fun = opcode_neg,     .name = "NEG"    }, /* done: needs reviewing + check C & V flags */
  { .fun = opcode_sbr,     .name = "SBR"    }, /* Code review & What's the difference between SBR & ORI */
  { .fun = opcode_cbr,     .name = "CBR"    }, /* Check opcode & code review */
  { .fun = opcode_clc,     .name = "CLC"    }, /* done: needs reviewing */
  { .fun = opcode_clh,     .name = "CLH"    }, /* done: needs reviewing */
  { .fun = opcode_clt,     .name = "CLT"    }, /* done: needs reviewing */
  { .fun = opcode_cli,     .name = "CLI"    },
  { .fun = opcode_cls,     .name = "CLS"    }, /* done: needs reviewing */
  { .fun = opcode_clv,     .name = "CLV"    }, /* done: needs reviewing */
  { .fun = opcode_clz,     .name = "CLZ"    }, /* done: needs reviewing */
  { .fun = opcode_in,      .name = "IN"     },
  { .fun = opcode_default, .name = "INC"    },
  { .fun = opcode_default, .name = "DEC"    },
  { .fun = opcode_default, .name = "TST"    },
  { .fun = opcode_default, .name = "CLR"    }, /* == OP_EOR */
  { .fun = opcode_cln,     .name = "CLN"    }, /* done: needs reviewing */
  { .fun = opcode_default, .name = "SPM"    },
  { .fun = opcode_seh,     .name = "SEH"    }, /* done: needs reviewing */
  { .fun = opcode_sen,     .name = "SEN"    }, /* done: needs reviewing */
  { .fun = opcode_ser,     .name = "SER"    }, /* done: needs reviewing */
  { .fun = opcode_sev,     .name = "SEV"    }, /* done: needs reviewing */
  { .fun = opcode_sez,     .name = "SEZ"    }, /* done: needs reviewing */
  { .fun = opcode_sleep,   .name = "SLEEP"  },
  { .fun = opcode_default, .name = "MUL"    },
  { .fun = opcode_default, .name = "MULS"   },
  { .fun = opcode_default, .name = "MULSU"  },
  { .fun = opcode_default, .name = "FMUL"   },
  { .fun = opcode_default, .name = "FMULS"  },
  { .fun = opcode_default, .name = "FMULSU" },
  { .fun = opcode_rjmp,    .name = "RJMP"   },
  { .fun = opcode_default, .name = "IJMP"   },
  { .fun = opcode_default, .name = "EIJMP"  },
  { .fun = opcode_elpm,    .name = "ELPM"   },
  { .fun = opcode_jmp,     .name = "JMP"    },
  { .fun = opcode_default, .name = "RCALL"  },
  { .fun = opcode_default, .name = "ICALL"  },
  { .fun = opcode_default, .name = "EICALL" },
  { .fun = opcode_call,    .name = "CALL"   },
  { .fun = opcode_ret,     .name = "RET"    },
  { .fun = opcode_default, .name = "RETI"   },
  { .fun = opcode_default, .name = "CPSE"   },
  { .fun = opcode_default, .name = "CBI"    },
  { .fun = opcode_cp,      .name = "CP"     },
  { .fun = opcode_cpc,     .name = "CPC"    },
  { .fun = opcode_cpi,     .name = "CPI"    },
  { .fun = opcode_default, .name = "ROR"    },
  { .fun = opcode_default, .name = "SBRC"   },
  { .fun = opcode_default, .name = "SBRS"   },
  { .fun = opcode_default, .name = "SBIC"   },
  { .fun = opcode_default, .name = "SBIS"   },
  { .fun = opcode_default, .name = "BRBS"   },
  { .fun = opcode_default, .name = "BRBC"   },
  { .fun = opcode_default, .name = "BLD"    },
  { .fun = opcode_default, .name = "BST"    },
  { .fun = opcode_breq,    .name = "BREQ"   },
  { .fun = opcode_brne,    .name = "BRNE"   },
  { .fun = opcode_default, .name = "BRCS"   },
  { .fun = opcode_brcc,    .name = "BRCC"   },
  { .fun = opcode_default, .name = "BRSH"   },
  { .fun = opcode_default, .name = "BRLO"   },
  { .fun = opcode_default, .name = "BRMI"   },
  { .fun = opcode_default, .name = "BRPL"   },
  { .fun = opcode_default, .name = "BRGE"   },
  { .fun = opcode_default, .name = "BRLT"   },
  { .fun = opcode_default, .name = "BRHS"   },
  { .fun = opcode_default, .name = "BRHC"   },
  { .fun = opcode_default, .name = "BRTS"   },
  { .fun = opcode_default, .name = "BRTC"   },
  { .fun = opcode_default, .name = "BRVS"   },
  { .fun = opcode_default, .name = "BRVC"   },
  { .fun = opcode_default, .name = "BRIE"   },
  { .fun = opcode_default, .name = "BRID"   },
  { .fun = opcode_mov,     .name = "MOV"    },
  { .fun = opcode_movw,    .name = "MOVW"   },
  { .fun = opcode_default, .name = "NOP"    },
  { .fun = opcode_ldi,     .name = "LDI"    },
  { .fun = opcode_default, .name = "LDS"    },
  { .fun = opcode_ld,      .name = "LD"     }, /* LD X */
  { .fun = opcode_ldd,     .name = "LD"     }, /* LD Y / Z */
  { .fun = opcode_default, .name = "LPM"    },
  { .fun = opcode_default, .name = "LSR"    },
  { .fun = opcode_out,     .name = "OUT"    },
  { .fun = opcode_pop,     .name = "POP"    },
  { .fun = opcode_push,    .name = "PUSH"   },
  { .fun = opcode_sbi,     .name = "SBI"    }, /* done: needs reviewing */
  { .fun = opcode_sec,     .name = "SEC"    }, /* done: needs reviewing */
  { .fun = opcode_ses,     .name = "SES"    }, /* done: needs reviewing */
  { .fun = opcode_set,     .name = "SET"    }, /* done: needs reviewing */
  { .fun = opcode_sei,     .name = "SEI"    },
  { .fun = opcode_default, .name = "SR"     },
  { .fun = opcode_st,      .name = "ST"     },
  { .fun = opcode_std,     .name = "ST"     },
  { .fun = opcode_sts,     .name = "STS"    },
  { .fun = opcode_default, .name = "SWAP"   },
  { .fun = opcode_default, .name = "WDR"    }
};


#define SET_CYCLES(n) do { } while (0) 
#define ADD_TO_PC(k)							\
  do {									\
    uint16_t next_pc;                                                   \
    next_pc = mcu_get_pc() + k;                                         \
    mcu_set_pc_next( next_pc );                                         \
  } while (0) 

static int opcode_default(uint16_t opcode, uint16_t UNUSED insn)
{
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  mcu_signal_set(SIG_MCU_ILL);
  HW_DMSG_DIS("Illegal / unknown opcode\n");
  ERROR("Illegal / unknown opcode\n");
  // PC unchanged
  SET_CYCLES(0);
  return opcode;
}

/* TODO: check flags management */
/**
 * \brief 
 * \param opcode
 * \param insn
 * \return opcode
 */
static int opcode_add(uint16_t opcode, uint16_t insn)
{
  uint8_t  dd, rr;
  int8_t  R, Rd, Rr;
  
  // 0000 11rd dddd rrrr
  dd = ((insn >> 4) & 0x1f);
  rr = ((insn >> 5) & 0x10) | (insn & 0x0f);
  HW_DMSG_DIS("%s r%d,r%d\n",OPCODES[opcode].name, dd, rr);
  
  Rd = MCU_REGS[dd];
  Rr = MCU_REGS[rr];
  R = Rd + Rr;
  MCU_REGS[dd] = R;

  WRITE_H(((BIT3_(Rd)) & (BIT3_(Rr))) | ((BIT3_(Rr)) & (BIT3n(R))) | ((BIT3n(R)) & (BIT3_(Rd))));
  WRITE_N(BIT7_(R));
  WRITE_V(((BIT7_(Rd)) & (BIT7_(Rr)) & (BIT7n(R))) | ((BIT7n(Rd)) & (BIT7n(Rr)) & (BIT7_(R))));
  WRITE_Z(R == 0);
  WRITE_S(READ_N ^ READ_V);
  WRITE_C(((BIT7_(Rd)) & (BIT7_(Rr))) | ((BIT7_(Rr)) & (BIT7n(R))) | ((BIT7n(R)) & (BIT7_(Rd))));
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: check flags management */
/**
 * \brief 
 * \param opcode
 * \param insn
 * \return opcode
 */
static int opcode_adc(uint16_t opcode, uint16_t insn)
{
  uint8_t  dd, rr;
  int8_t  R, Rd, Rr;
  
