afrab/WSim/arch/atmega/atmega128_alu.c
  // 0001 11rd dddd rrrr
  dd = ((insn >> 4) & 0x1f);
  rr = ((insn >> 5) & 0x10) | (insn & 0x0f);
  HW_DMSG_DIS("%s r%d,r%d\n",OPCODES[opcode].name, dd, rr);
  
  Rd = MCU_REGS[dd];
  Rr = MCU_REGS[rr];
  R = Rd + Rr + READ_C;
  MCU_REGS[dd] = R;
  
  WRITE_H(((BIT3_(Rd)) & (BIT3_(Rr))) | ((BIT3_(Rr)) & (BIT3n(R))) | ((BIT3n(R)) & (BIT3_(Rd))));
  WRITE_N(BIT7_(R));
  WRITE_V((BIT7_(Rd) & BIT7_(Rr) & BIT7n(R)) | (BIT7n(Rd) & BIT7n(Rr) & BIT7_(R)));
  WRITE_Z(R == 0);
  WRITE_S(READ_N ^ READ_V);
  WRITE_C(((BIT7_(Rd)) & (BIT7_(Rr))) | ((BIT7_(Rr)) & (BIT7n(R))) | ((BIT7n(R)) & (BIT7_(Rd))));
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_sleep(uint16_t opcode, uint16_t UNUSED insn)
{
  // 1001 0101 1000 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  /* #define IO_REG_MCUCR         0x35 / 0x55 */

  mcu_signal_set(SIG_MCU_ILL);
  HW_DMSG_DIS("Illegal / unknown opcode\n");

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_sei(uint16_t opcode, uint16_t UNUSED insn)
{
  // 1001 0100 0111 1000  
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  // set global interrupt flag
  SET_I;
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_jmp(uint16_t opcode, uint16_t insn)
{
  uint32_t addr;
  uint16_t offset;
  //                A1   A2   B1   B2   C1   C2   D1   D2
  // 0c 94 66 00 : 0000 1100 1001 0100 0110 0110 0000 0000
  //                
  //                B1   B2   A1   A2   D1   D2   C1   C2
  //               1001 0100 0000 1100 0000 0000 0110 0110
  //
  // reference     1001 010k kkkk 110k kkkk kkkk kkkk kkkk
  // jmp 0xcc                                    1100 1100
 
  offset = atmega128_flash_read_short((mcu_get_pc()+1) << 1);
  addr   = ((insn >> 3) & 0x1f) | (insn & 1);
  //offset = atmega128_flash_read_short(mcu_get_pc()+1);
  //addr   = ((insn >> 3) & 0x3e) | (insn & 1);
  addr   = (addr << 16) | offset;
  HW_DMSG_DIS("%s 0x%06x [0x%08x]\n",OPCODES[opcode].name, addr << 1, insn << 16 | offset);

  mcu_set_pc_next( addr ); // PC is aligned on words
  SET_CYCLES(3);
  return opcode;
}

static int opcode_eor(uint16_t opcode, uint16_t insn)
{
  uint8_t rd;
  uint8_t rr;
  uint8_t res;
  // 0010 01rd dddd rrrr
  rr = ((insn >> 5) & 0x10) | ((insn >> 0) & 0x0f);
  rd = ((insn >> 4) & 0x1f);
  HW_DMSG_DIS("%s r%d,r%d\n",OPCODES[opcode].name, rd, rr);

  res = MCU_REGS[rr] ^ MCU_REGS[rd];
  MCU_REGS[rd] = res;

  CLR_V;
  WRITE_N(BIT7_(res));
  WRITE_Z(res == 0);
  WRITE_S(READ_N ^ READ_V);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: code review */
static int opcode_com(uint16_t opcode, uint16_t insn)
{
  uint8_t dd;
  int8_t R;

  // 1001 010d dddd 0000
  dd = ((insn >> 4) & 0x1f);
  HW_DMSG_DIS("%s r%d\n",OPCODES[opcode].name, dd);

  R = 0xFF - MCU_REGS[dd];
  MCU_REGS[dd] = R;
  
  SET_C;
  CLR_V;
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  WRITE_S(READ_N ^ READ_V);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: check C, V flags & code review */
static int opcode_neg(uint16_t opcode, uint16_t insn)
{
  uint8_t dd;
  int8_t R, Rd;

  // 1001 010d dddd 0001
  dd = ((insn >> 4) & 0x1f);
  HW_DMSG_DIS("%s r%d\n",OPCODES[opcode].name, dd);
  
  Rd = MCU_REGS[dd];
  R = 0x00 - Rd;
  MCU_REGS[dd] = R;
  
  WRITE_H((BIT3_(R)) | (BIT3_(Rd)));
  if (R) SET_C;
  if (R == 0x80) SET_V;
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  WRITE_S(READ_N ^ READ_V);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: What's the difference sbr &S ori? */
static int opcode_sbr(uint16_t opcode, uint16_t insn)
{
  uint8_t dd, kk;
  int8_t R;

  // 0110 KKKK dddd KKKK
  kk = ((insn >> 4) & 0xf0) | ((insn >> 0) & 0xf);
  dd = ((insn >> 4) & 0x0f) + 16;
  HW_DMSG_DIS("%s r%d,0x%02x\n",OPCODES[opcode].name, dd, kk);
  
  R = MCU_REGS[dd] | kk;
  MCU_REGS[dd] = R;
  
  CLR_V;
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  WRITE_S(READ_N ^ READ_V);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Check opcode */
static int opcode_cbr(uint16_t opcode, uint16_t insn)
{
  uint8_t dd, kk;
  int8_t R;

  // 0111 KKKK dddd KKKK
  dd = ((insn >> 4) & 0x0f) + 16;
  kk  = ((insn >> 4) & 0xf0) | (insn & 0x0f);
  HW_DMSG_DIS("%s r%d,0x%x\n",OPCODES[opcode].name, dd, kk);
  
  R = MCU_REGS[dd] & (0xff - kk);
  MCU_REGS[dd] = R;
  
  CLR_V;
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  WRITE_S(READ_N ^ READ_V);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_clc(uint16_t opcode, uint16_t insn)
{
  // 1001 0100 1000 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // clear global interrupt flag
  CLR_C;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_clh(uint16_t opcode, uint16_t insn)
{
  // 1001 0100 1101 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // clear global interrupt flag
  CLR_H;

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_clt(uint16_t opcode, uint16_t insn)
{
  // 1001 0100 1110 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // clear global interrupt flag
  CLR_T;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_cli(uint16_t opcode, uint16_t UNUSED insn)
{
  // 1001 0100 1111 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // clear global interrupt flag
  CLR_I;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_cls(uint16_t opcode, uint16_t UNUSED insn)
{
  // 1001 0100 1100 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // clear global interrupt flag
  CLR_S;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_clv(uint16_t opcode, uint16_t UNUSED insn)
{
  // 1001 0100 1011 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // clear global interrupt flag
  CLR_V;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_clz(uint16_t opcode, uint16_t UNUSED insn)
{
  // 1001 0100 1001 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // clear global interrupt flag
  CLR_Z;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_cln(uint16_t opcode, uint16_t UNUSED insn)
{
  // 1001 0100 1010 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // clear global interrupt flag
  CLR_N;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_ori(uint16_t opcode, uint16_t insn)
{
  uint8_t dd;
  uint8_t kk;
  uint8_t res;
  // 0110 KKKK dddd KKKK
  kk = ((insn >> 4) & 0xf0) | ((insn >> 0) & 0xf);
  dd = ((insn >> 4) & 0x0f) + 16;
  HW_DMSG_DIS("%s r%d,0x%02x\n",OPCODES[opcode].name, dd, kk);

  res = MCU_REGS[dd] | kk;
  MCU_REGS[dd] = res;
  CLR_V;
  WRITE_N(BIT7_(res));
  WRITE_Z(res == 0);
  WRITE_S(READ_N ^ READ_V);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: code review */
static int opcode_adiw(uint16_t opcode, uint16_t insn)
{
  uint8_t  K;
  uint8_t  dd;
  uint8_t  Rdh, Rdl;
  uint16_t  R;
 
  // 1001 0110 KKdd KKKK
  /* we need to the immediate value kkkkkk from 00000000 kk00kkkk const 0-63  */
  K = ((insn&0x00C0)>>2)|(insn&0x000F);
  /* we need the register pair's lowest address from 00000000 00dd0000 in r24,r26,r28,r30 */
  dd = ((insn&0x0030)>>3)+24;
  HW_DMSG_DIS("%s r%d,0x%02x\n",OPCODES[opcode].name, dd, K);
  
  Rdl = MCU_REGS[dd];
  Rdh = MCU_REGS[dd+1];
  R = (Rdh<<8) + Rdl;
  R+=K;
  MCU_REGS[dd] = (uint8_t)R;
  MCU_REGS[dd+1] = (uint8_t)(R>>8);
  
  WRITE_V((BIT7n(Rdh)) & (BIT15_(R)));
  WRITE_S(READ_N ^ READ_V);
  WRITE_C((BIT15n(R)) & (BIT7_(Rdh)));
  WRITE_N(BIT15_(R));
  WRITE_Z(R == 0);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

static int opcode_and(uint16_t opcode, uint16_t insn)
{
  uint8_t rd;
  uint8_t rr;
  uint8_t res;
  // 0010 00rd dddd rrrr
  rr = ((insn >> 5) & 0x10) | ((insn >> 0) & 0xf);
  rd = ((insn >> 4) & 0x1f);
  HW_DMSG_DIS("%s r%d,r%d\n",OPCODES[opcode].name, rd, rr);

  res = MCU_REGS[rr] & MCU_REGS[rd];
  MCU_REGS[rd] = res;
  CLR_V;
  WRITE_N(BIT7_(res));
  WRITE_Z(res == 0);
  WRITE_S(READ_N ^ READ_V);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: code review */
static int opcode_andi(uint16_t opcode, uint16_t insn)
{
  uint8_t dd;
  uint8_t K;
  int8_t  R;
  
