afrab/WSim/arch/atmega/atmega128_alu.c
  // 0111 KKKK dddd KKKK
  dd = ((insn >> 4) & 0x0f) + 16;
  K  = ((insn >> 4) & 0xf0) | (insn & 0x0f);
  HW_DMSG_DIS("%s r%d,0x%x\n",OPCODES[opcode].name, dd, K);
  
  R = K & MCU_REGS[dd];
  MCU_REGS[dd] = R;
  
  CLR_V;
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  WRITE_S(READ_N ^ READ_V);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: check flag management */
static int opcode_asr(uint16_t opcode, uint16_t insn)
{
  uint8_t dd;
  int8_t R;
  
  // 1001 010d dddd 0101
  dd = ((insn >> 4) & 0x1f);
  HW_DMSG_DIS("%s r%d\n",OPCODES[opcode].name, dd);
  
    /* set flag C */
  WRITE_C(MCU_REGS[dd]&0x01);
  
  R = MCU_REGS[dd]>>1;
  MCU_REGS[dd] = R;

  WRITE_V(READ_N ^ READ_C);
  WRITE_S(READ_N ^ READ_V);
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_out(uint16_t opcode, uint16_t insn)
{
  uint8_t  rr;
  uint8_t  aa;
  // 1011 1AAr rrrr AAAA
  rr = ((insn >> 4) & 0x1f);
  aa = ((insn >> 5) & 0x30) | ((insn >> 0) & 0xf);
  HW_DMSG_DIS("%s 0x%02x,r%d\n",OPCODES[opcode].name, aa, rr);

  atmega128_io_write_byte(aa,MCU_REGS[rr]);
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_rjmp(uint16_t opcode, uint16_t insn)
{
  int16_t kk;
  // 1100 kkkk kkkk kkkk
  kk = insn & 0x0fff;
  if (kk & 0x0800) /* sign extension */
    kk |= 0xf000;
  HW_DMSG_DIS("%s %s%d\n",OPCODES[opcode].name, (kk < 0) ? ".":".+", kk * 2);

  ADD_TO_PC( kk + 1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

static int opcode_cpi(uint16_t opcode, uint16_t insn)
{
  uint8_t dd;
  uint8_t K;
  int8_t  Rd;
  int8_t  R;
  // 0011 KKKK dddd KKKK
  dd = ((insn >> 4) & 0x0f) + 16;
  K  = ((insn >> 4) & 0xf0) | (insn & 0x0f);
  HW_DMSG_DIS("%s r%d,0x%x\n",OPCODES[opcode].name, dd, K);
  
  Rd = MCU_REGS[dd];
  R  = Rd - K;
  
  WRITE_H(((BIT3n(Rd)) & (BIT3_(K)))  |  ((BIT3_(K)) & (BIT3_(R)))  |  ((BIT3_(R)) & (BIT3n(Rd))));
  WRITE_V(((BIT7_(Rd)) & (BIT7n(K)) & (BIT7n(R))) | ((BIT7n(Rd)) & (BIT7_(K)) & (BIT7_(R))));
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  WRITE_C(((BIT7n(Rd)) & (BIT7_(K))) | ((BIT7_(K)) & (BIT7_(R))) | ((BIT7_(R)) & (BIT7n(Rd))));
  WRITE_S(READ_N ^ READ_V);

  atmega128_print_SR();

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_cpc(uint16_t opcode, uint16_t insn)
{
  uint8_t rd, rr;
  int8_t  Rd, Rr;
  int8_t  R, C;
  // 0000 01rd dddd rrrr
  rr = ((insn >> 5) & 0x10) | ((insn >> 0) & 0x0f);
  rd = ((insn >> 4) & 0x10) | ((insn >> 4) & 0x0f);
  HW_DMSG_DIS("%s r%d,r%d\n",OPCODES[opcode].name, rd, rr);
  
  Rd = MCU_REGS[rd];
  Rr = MCU_REGS[rr];
  C  = READ_C;
  R  = Rd - Rr - C;
  // same tests as CP
  WRITE_H(((BIT3n(Rd)) & (BIT3_(Rr))) | ((BIT3_(Rr)) & (BIT3_(R))) | ((BIT3_(R)) & (BIT3n(Rd))));
  WRITE_V(((BIT7_(Rd)) & (BIT7n(Rr)) & (BIT7n(R))) | ((BIT7n(Rd)) & (BIT7_(Rr)) & (BIT7_(R))));
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  WRITE_C(((BIT7n(Rd)) & (BIT7_(Rr))) | ((BIT7_(Rr)) & (BIT7_(R))) | ((BIT7_(R)) & (BIT7n(Rd))));
  WRITE_S(READ_N ^ READ_V);

  atmega128_print_SR();
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_brne(uint16_t opcode, uint16_t insn)
{
  int8_t K;
  // 1111 01kk kkkk k001
  K  = ((insn >> 3) & 0x7f);
  if (K & 0x40) /* sign extension */
    K |= 0x80;
  HW_DMSG_DIS("%s %s%d\n",OPCODES[opcode].name, (K<0)?".":".+", K * 2);
  if (! READ_Z)
    {
      ADD_TO_PC( K + 1 );
      SET_CYCLES(2);
    }
  else
    {
      ADD_TO_PC(1); // PC is aligned on words
      SET_CYCLES(1);
    }
  return opcode;
}

static int opcode_brcc(uint16_t opcode, uint16_t insn)
{
  int8_t K;
  // 1111 01kk kkkk k000
  K  = ((insn >> 3) & 0x7f);
  if (K & 0x40) /* sign extension */
    K |= 0x80;
  HW_DMSG_DIS("%s %s%d\n",OPCODES[opcode].name, (K<0)?".":".+", K * 2);
  if (READ_C)
    {
      ADD_TO_PC( K + 1 );
      SET_CYCLES(2);
    }
  else
    {
      ADD_TO_PC(1); // PC is aligned on words
      SET_CYCLES(1);
    }
  return opcode;
}

static int opcode_breq(uint16_t opcode, uint16_t insn)
{
  int8_t K;
  // 1111 00kk kkkk k001
  K  = ((insn >> 3) & 0x7f);
  if (K & 0x40) /* sign extension */
    K |= 0x80;
  HW_DMSG_DIS("%s %s%d\n",OPCODES[opcode].name, (K<0)?".":".+", K * 2);
  if (READ_Z)
    {
      ADD_TO_PC(K + 1);
      SET_CYCLES(2);
    }
  else
    {
      ADD_TO_PC(1); // PC is aligned on words
      SET_CYCLES(1);
    }
  return opcode;
}

static int opcode_elpm(uint16_t opcode, uint16_t insn)
{
  uint8_t  dd;
  int8_t   zplus;
  uint32_t addr;
  /* OPT:POSSIBLE_SPLIT_OPCODE */
  // (i)   1001 0101 1101 1000
  // (ii)  1001 000d dddd 0110
  // (iii) 1001 000d dddd 0111
  if (BIT4_(insn))
    {
      dd = 0;
    }
  else
    {
      dd = (insn >> 4) & 0x1f;
    }
  zplus = BIT0_(insn);
  HW_DMSG_DIS("%s r%d,Z%s\n",OPCODES[opcode].name, dd, (zplus)?"+":"");

  addr  = ((RAMPZ & 1) << 16) | ((MCU_REGS[31] << 8) & 0xff00) | (MCU_REGS[30] & 0xff);
  HW_DMSG_DIS("     r30 = 0x%02x | r30 = 0x%02x | addr = 0x%0x\n",MCU_REGS[31], MCU_REGS[30] & 0xff, addr);
  MCU_REGS[dd] = atmega128_flash_read_byte(addr);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(3);
  return opcode;
}

static int opcode_call(uint16_t opcode, uint16_t UNUSED insn)
{
  uint32_t SP;
  uint32_t addr;
  uint16_t offset;
  // 1001 010k kkkk 111k
  // kkkk kkkk kkkk kkkk
  offset = atmega128_flash_read_short((mcu_get_pc() + 1) << 1);
  addr   = ((insn >> 3) & 0x3e) | (insn & 1);
  addr   = (addr << 16) | offset;
  HW_DMSG_DIS("%s 0x%06x [0x%08x]\n",OPCODES[opcode].name, addr << 1, insn << 16 | offset);

  mcu_set_pc_next(addr);
  SP = SP_READ();
  HW_DMSG_DIS("atmega128: PC = 0x%04x\n",mcu_get_pc());
  HW_DMSG_DIS("atmega128: SP = 0x%04x\n",SP);
  atmega128_ram_write_short(SP, mcu_get_pc() + 1); // STACK = PC + 1;

#if defined(ATMEGA_PC_16BITS)
  SP = SP - 2;
  SP_WRITE(SP);
  SET_CYCLES(4); 
#elif defined(ATMEGA_PC_22BITS)
  SP = SP - 3;
  SP_WRITE(SP);
  SET_CYCLES(5);
#else
#error "must define PC size to 16 or 22 bits"
#endif

  return opcode;
}

static int opcode_ret(uint16_t opcode, uint16_t UNUSED insn)
{
  uint32_t SP;
  // 1001 0101 0000 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  SP = SP_READ(); // pre-increment scheme
#if defined(ATMEGA_PC_16BITS)
  SP = SP + 2;
  SP_WRITE(SP);
  SET_CYCLES(4); 
#elif defined(ATMEGA_PC_22BITS)
  SP = SP + 3;
  SP_WRITE(SP);
  SET_CYCLES(5);
#else
#error "must define PC size to 16 or 22 bits"
#endif
  mcu_set_pc_next( atmega128_ram_read_short(SP) );
  return opcode;
}

static int opcode_in(uint16_t opcode, uint16_t insn)
{
  uint8_t dd;
  uint8_t aa;
  // 1011 0AAd dddd AAAA
  dd = ((insn >> 4) & 0x1f);
  aa = ((insn >> 5) & 0x30) | ((insn >> 0) & 0x0f);
  HW_DMSG_DIS("%s r%d,0x%02x\n",OPCODES[opcode].name, dd, aa);

  MCU_REGS[dd] = atmega128_io_read_byte(aa);
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_set(uint16_t opcode, uint16_t insn)
{
  // 1001 0100 0110 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // set global interrupt flag
  SET_T;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_seh(uint16_t opcode, uint16_t insn)
{
  // 1001 0100 0101 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // set global interrupt flag
  SET_H;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_sen(uint16_t opcode, uint16_t insn)
{
  // 1001 0100 0010 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // set global interrupt flag
  SET_N;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_ser(uint16_t opcode, uint16_t insn)
{
  uint8_t dd;
  
  // 1110 1111 dddd 1111
  dd = ((insn >> 4) & 0x0f);
  HW_DMSG_DIS("%s r%d\n",OPCODES[opcode].name, dd);
  
  // set all bits in register Rd
  MCU_REGS[dd] = 0xff;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_sev(uint16_t opcode, uint16_t insn)
{
  // 1001 0100 0011 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // set global interrupt flag
  SET_V;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_sez(uint16_t opcode, uint16_t insn)
{
  // 1001 0100 0001 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // set global interrupt flag
  SET_Z;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

