afrab/WSim/arch/atmega/atmega128_alu.c
static int opcode_mov(uint16_t opcode, uint16_t insn)
{
  uint8_t rr;
  uint8_t dd;
  // 0010 11rd dddd rrrr
  rr = ((insn >> 5) & 0x10) | (insn & 0x0f); 
  dd = ((insn >> 4) & 0x1f);
  HW_DMSG_DIS("%s r%d,r%d\n",OPCODES[opcode].name,dd,rr);
  MCU_REGS[dd] = MCU_REGS[rr];
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_movw(uint16_t opcode, uint16_t insn)
{
  uint8_t rr;
  uint8_t dd;
  // 0000 0001 dddd rrrr
  rr = ((insn >> 0) & 0x0f) << 1;
  dd = ((insn >> 4) & 0x0f) << 1;
  HW_DMSG_DIS("%s r%d:r%d,r%d:r%d\n",OPCODES[opcode].name,dd+1,dd,rr+1,rr);

  MCU_REGS[dd + 1] = MCU_REGS[rr + 1];
  MCU_REGS[dd    ] = MCU_REGS[rr    ];

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_sts(uint16_t opcode, uint16_t insn)
{
  uint8_t  dd;
  uint16_t kk;
  // 1001 001d dddd 0000
  // kkkk kkkk kkkk kkkk
  dd = ((insn >> 4) & 0x1f);
  kk = atmega128_flash_read_short((mcu_get_pc()+1) << 1);
  // check RAMPD if anything goes wrong
  HW_DMSG_DIS("%s 0x%04x,r%d\n",OPCODES[opcode].name,kk,dd);
  atmega128_ram_write_byte(kk,MCU_REGS[dd]);
  ADD_TO_PC(2); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

static int opcode_st(uint16_t opcode, uint16_t insn)
{
  uint16_t X;
  uint8_t  rr;
  int predec, postinc;
  /* OPT:POSSIBLE_SPLIT_OPCODE */
  // (i)   1001 001r rrrr 1100
  // (ii)  1001 001r rrrr 1101
  // (iii) 1001 001r rrrr 1110
  X  = REG_X_READ();
  rr = (insn >> 4) & 0x1f;
  postinc = BIT0_(insn);
  predec  = BIT1_(insn);
  HW_DMSG_DIS("%s %sX%s,r%d\n",OPCODES[opcode].name, predec ? "-":"", postinc ? "+":"", rr);

  if (predec)
    {
      X--;
    }
  atmega128_ram_write_byte(X, MCU_REGS[rr]);
  if (postinc)
    {
      X++;
    }
  REG_X_WRITE(X);
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

static int opcode_std(uint16_t opcode, uint16_t UNUSED insn)
{
  int depl, y;
  uint8_t  rr;
  char chrindex;
  uint16_t Index;

  /* OPT:POSSIBLE_SPLIT_OPCODE */
  // Y register
  // ==========
  // (i)    1000 001r rrrr 1000
  // (ii)   1001 001r rrrr 1001  post increment
  // (iii)  1001 001r rrrr 1010  pre decrement
  // (iiii) 10q0 qq1r rrrr 1qqq  q displacement
  //
  // Z register
  // ==========
  // (i)    1000 001r rrrr 0000
  // (ii)   1001 001r rrrr 0001  post increment
  // (iii)  1001 001r rrrr 0010  pre decrement
  // (iiii) 10q0 qq1r rrrr 0qqq  q displacement
  y    = BIT3_(insn); /* index on Y or Z */
  if (y)
    {
      chrindex = 'Y';
      Index = REG_Y_READ();
    }
  else
    {
      chrindex = 'Z';
      Index = REG_Y_READ();
    }
  rr   = (insn >> 4) & 0x1f;
  depl = BIT12n(insn); /* 0: displacement, 1:pre/post */
  if (depl)
    {
      uint8_t qq = ((insn >> 8) & 0x10) | ((insn >> 7) & 0x18) | (insn & 0x07);
      if (qq == 0) /* STD (i)  */
	{
	  HW_DMSG_DIS("%s %c,r%d\n",OPCODES[opcode].name, chrindex, rr);
	}
      else         /* STD (iv) */
	{
	  HW_DMSG_DIS("%s %c+%d,r%d\n",OPCODES[opcode].name, qq, chrindex, rr);
	}
      atmega128_ram_write_byte(Index + qq, MCU_REGS[rr]);
    }
  else
    {
      int predec, postinc;
      postinc = BIT0_(insn); /* bit12 is set on increment */
      predec  = BIT1_(insn); 
      HW_DMSG_DIS("%s %s%c%s,r%d\n",OPCODES[opcode].name, predec ? "-":"", chrindex, postinc ? "+":"", rr);
      if (predec) 
	{
	  Index --;
	}
      atmega128_ram_write_byte(Index, MCU_REGS[rr]);
      if (postinc) 
	{
	  Index ++;
	}
      if (y) 
	{
	  REG_Y_WRITE(Index);
	} 
      else 
	{
	  REG_Z_WRITE(Index);
	}
    }
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

static int opcode_cp(uint16_t opcode, uint16_t insn)
{
  uint8_t rr, dd;
  int8_t  Rd, Rr;
  int8_t  R;
  // 0001 01rd dddd rrrr
  rr = ((insn >> 5) & 0x10) | ((insn >> 0) & 0x0f);
  dd = ((insn >> 4) & 0x10) | ((insn >> 4) & 0x0f);
  HW_DMSG_DIS("%s r%d,r%d\n",OPCODES[opcode].name, dd, rr);

  Rd = MCU_REGS[dd];
  Rr = MCU_REGS[rr];
  R  = Rd - Rr;
  // same tests as CPC
  WRITE_H(((BIT3n(Rd)) & (BIT3_(Rr))) | ((BIT3_(Rr)) & (BIT3_(R))) | ((BIT3_(R)) & (BIT3n(Rd))));
  WRITE_V(((BIT7_(Rd)) & (BIT7n(Rr)) & (BIT7n(R))) | ((BIT7n(Rd)) & (BIT7_(Rr)) & (BIT7_(R))));
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  WRITE_C(((BIT7n(Rd)) & (BIT7_(Rr))) | ((BIT7_(Rr)) & (BIT7_(R))) | ((BIT7_(R)) & (BIT7n(Rd))));
  WRITE_S(READ_N ^ READ_V);
  
  atmega128_print_SR();
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: code review */
static int opcode_sub(uint16_t opcode, uint16_t insn)
{
  uint8_t dd, rr;
  int8_t  R, Rd, Rr;
  
  // 0001 10rd dddd rrrr
  dd = ((insn >> 4) & 0x1f);
  rr = ((insn >> 5) & 0x10) | (insn & 0x0f);
  HW_DMSG_DIS("%s r%d,r%d\n",OPCODES[opcode].name, dd, rr);
  
  Rd=MCU_REGS[dd];
  Rr=MCU_REGS[rr];
  R = Rd - Rr;
  MCU_REGS[dd] = R;
  
  WRITE_H(((BIT3n(Rd)) & (BIT3_(Rr))) | ((BIT3_(Rr)) & (BIT3_(R))) | ((BIT3_(R)) & (BIT3n(Rd))));
  WRITE_V(((BIT7_(Rd)) & (BIT7n(Rr)) & (BIT7n(R))) | ((BIT7n(Rd)) & (BIT7_(Rr)) & (BIT7_(R))));
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  WRITE_C(((BIT7n(Rd)) & (BIT7_(Rr))) | ((BIT7_(Rr)) & (BIT7_(R))) | ((BIT7_(R)) & (BIT7n(Rd))));
  WRITE_S(READ_N ^ READ_V);

  atmega128_print_SR();

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_subi(uint16_t opcode, uint16_t insn)
{
  uint8_t dd;
  uint8_t K;
  int8_t  Rd;
  int8_t  R;
  // 0101 KKKK dddd KKKK
  dd = ((insn >> 4) & 0x0f) + 16;
  K  = ((insn >> 4) & 0xf0) | (insn & 0x0f);
  HW_DMSG_DIS("%s r%d,0x%02x\n",OPCODES[opcode].name, dd, K);
  
  Rd = MCU_REGS[dd];
  R  = Rd - K;
  MCU_REGS[dd] = R;

  WRITE_H(((BIT3n(Rd)) & (BIT3_(K)))  |  ((BIT3_(K)) & (BIT3_(R)))  |  ((BIT3_(R)) & (BIT3n(Rd))));
  WRITE_V(((BIT7_(Rd)) & (BIT7n(K)) & (BIT7n(R))) | ((BIT7n(Rd)) & (BIT7_(K)) & (BIT7_(R))));
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  WRITE_C(((BIT7n(Rd)) & (BIT7_(K))) | ((BIT7_(K)) & (BIT7_(R))) | ((BIT7_(R)) & (BIT7n(Rd))));
  WRITE_S(READ_N ^ READ_V);

  atmega128_print_SR();

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: code review & check flag */
static int opcode_sbc(uint16_t opcode, uint16_t insn)
{
  uint8_t dd, rr;
  int8_t Rd, Rr;
  int8_t R;
  
