afrab/WSim/arch/atmega/atmega128_alu.c
  // 0000 10rd dddd rrrr
  dd = ((insn >> 4) & 0x1f);
  rr = ((insn >> 5) & 0x10) | (insn & 0x0f);
  HW_DMSG_DIS("%s r%d,r%d\n",OPCODES[opcode].name, dd, rr);
	
  Rd=MCU_REGS[dd];
  Rr=MCU_REGS[rr];
  
  R = Rd - Rr - READ_C;
  MCU_REGS[dd] = R;
  
  WRITE_H(((BIT3n(Rd)) & (BIT3_(Rr))) | ((BIT3_(Rr)) & (BIT3_(R))) | ((BIT3_(R)) & (BIT3n(Rd))));
  WRITE_S(READ_N ^ READ_V);
  WRITE_V(((BIT7_(Rd)) & (BIT7n(Rr)) & (BIT7n(R))) | ((BIT7n(Rd)) & (BIT7_(Rr)) & (BIT7_(R))));
  WRITE_N(BIT7_(R));
	WRITE_C(((BIT7n(Rd)) & (BIT7_(Rr))) | ((BIT7_(Rr)) & (BIT7_(R))) | ((BIT7_(R)) & (BIT7n(Rd))));
  if (R) CLR_Z;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: code review & check flags */
static int opcode_sbci(uint16_t opcode, uint16_t insn)
{
  uint8_t dd;
  int8_t  R, Rd;
  uint8_t K;
  
  // 0100 KKKK dddd KKKK
  dd = ((insn >> 4) & 0x0f) + 16;
  K  = ((insn >> 4) & 0xf0) | (insn & 0x0f);
  HW_DMSG_DIS("%s r%d,0x%x\n",OPCODES[opcode].name, dd, K);
  
  Rd = MCU_REGS[dd];
  R = Rd - K - READ_C;
  MCU_REGS[dd] = R;
  
  WRITE_H(((BIT3n(Rd)) & (BIT3_(K))) | ((BIT3_(K)) & (BIT3_(R))) | ((BIT3_(R)) & (BIT3n(Rd))));
  WRITE_S(READ_N ^ READ_V);
  WRITE_V(((BIT7_(Rd)) & (BIT7n(K)) & (BIT7n(R))) | ((BIT7n(Rd)) & (BIT7_(K)) & (BIT7_(R))));
  WRITE_N(BIT7_(R));
	WRITE_C(((BIT7n(Rd)) & (BIT7_(K))) | ((BIT7_(K)) & (BIT7_(R))) | ((BIT7_(R)) & (BIT7n(Rd))));
  if (R) CLR_Z;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: check flags management */
static int opcode_sbiw(uint16_t opcode, uint16_t insn)
{
  uint8_t  K;
  uint8_t  dd;
  uint8_t   Rdh, Rdl;
  uint16_t  R;
  
  // 1001 0111 KKdd KKKK
  K = ((insn&0x00C0)>>2)|(insn&0x000F);
  dd = ((insn&0x0030)>>3)+24;
  HW_DMSG_DIS("%s r%d,0x%02x\n",OPCODES[opcode].name, dd, K);
  
  Rdl = MCU_REGS[dd];
  Rdh = MCU_REGS[dd+1];
  R = (Rdh<<8) + Rdl;
  R-=K;
  MCU_REGS[dd] = (uint8_t)R;
  MCU_REGS[dd+1] = (uint8_t)(R>>8);
  
  WRITE_V(BIT7_(Rdh) & BIT15n(R));
  WRITE_S(READ_N ^ READ_V);
  WRITE_C(BIT15_(R) & BIT7n(Rdh));
  WRITE_N(BIT15_(R));
  WRITE_Z(R == 0);
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

/* TODO: Code review */
static int opcode_or(uint16_t opcode, uint16_t insn)
{
  uint8_t dd, rr;
  int8_t R;
  
  // 0010 10rd dddd rrrr
  dd = ((insn >> 4) & 0x1f);
  rr = ((insn >> 5) & 0x10) | (insn & 0x0f);
  HW_DMSG_DIS("%s r%d,r%d\n",OPCODES[opcode].name, dd, rr);
  
  R = MCU_REGS[dd] | MCU_REGS[rr];
  MCU_REGS[dd] = R;

  WRITE_S(READ_N ^ READ_V);
  CLR_V;
  WRITE_N(BIT7_(R));
  WRITE_Z(R == 0);
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

static int opcode_ldi(uint16_t opcode, uint16_t insn)
{
  uint8_t  rd;
  int8_t   kk;
  // 1110 KKKK dddd KKKK
  rd = ((insn >> 4) & 0x0f) + 16;
  kk = ((insn >> 4) & 0xf0) | ((insn >> 0) & 0x0f);
  HW_DMSG_DIS("%s r%d,0x%02x\n",OPCODES[opcode].name, rd, kk & 0x00ff);

  MCU_REGS[rd] = kk;
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

static int opcode_ld(uint16_t opcode, uint16_t insn)
{
  uint8_t  dd;
  uint16_t Index;
  int predec, postinc;
  // X register
  // ==========
  // (i)   1001 000d dddd 1100 
  // (ii)  1001 000d dddd 1101  postinc
  // (iii) 1001 000d dddd 1110  predec
  Index = REG_X_READ();
  dd   = ((insn >> 4) & 0x1f);
  postinc = BIT0_(insn);
  predec  = BIT1_(insn); 
  HW_DMSG_DIS("%s r%d,%sX%s\n",OPCODES[opcode].name, dd, predec ? "-":"", postinc ? "+":"");

  if (predec) 
    {
      Index --;
    }
  MCU_REGS[dd] = atmega128_ram_read_byte(Index);
  if (postinc) 
    {
      Index ++;
    }
  REG_X_WRITE(Index);
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

static int opcode_ldd(uint16_t opcode, uint16_t insn)
{
  int depl, y;
  uint8_t dd;
  char chrindex;
  uint16_t Index;

  // Y register
  // ==========
  // (i)    1000 000d dddd 1000 
  // (ii)   1001 000d dddd 1001    post increment
  // (iii)  1001 000d dddd 1010    pre decrement
  // (iiii) 10q0 qq0d dddd 1qqq    q displacement
  //
  // Z register
  // ==========
  // (i)    1000 000d dddd 0000
  // (ii)   1001 000d dddd 0001    post increment
  // (iii)  1001 000d dddd 0010    pre decrement
  // (iiii) 10q0 qq0d dddd 0qqq    q displacement
  y    = BIT3_(insn); /* index on Y or Z */
  if (y)
    {
      chrindex = 'Y';
      Index = REG_Y_READ();
    }
  else
    {
      chrindex = 'Z';
      Index = REG_Y_READ();
    }
  dd   = ((insn >> 4) & 0x1f);
  depl = BIT12n(insn);
  if (depl)
    {
        uint8_t qq = ((insn >> 8) & 0x10) | ((insn >> 7) & 0x18) | (insn & 0x07);
      if (qq == 0) /* LD (i)  */
	{
	  HW_DMSG_DIS("%s r%d,%c\n",OPCODES[opcode].name, dd, chrindex);
	}
      else         /* LD (iv) */
	{
	  HW_DMSG_DIS("%s r%d,%c+%d\n",OPCODES[opcode].name, dd, qq, chrindex);
	}
      MCU_REGS[dd] = atmega128_ram_read_byte(Index + qq);
    }
  else
    {
      int predec, postinc;
      postinc = BIT0_(insn); /* bit12 is set on increment */
      predec  = BIT1_(insn); 
      HW_DMSG_DIS("%s r%d,%s%c%s\n",OPCODES[opcode].name, dd, predec ? "-":"", chrindex, postinc ? "+":"");
      if (predec) 
	{
	  Index --;
	}
      MCU_REGS[dd] = atmega128_ram_read_byte(Index);
      if (postinc) 
	{
	  Index ++;
	}
      if (y) 
	{
	  REG_Y_WRITE(Index);
	} 
      else 
	{
	  REG_Z_WRITE(Index);
	}
    }
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}


static int opcode_push(uint16_t opcode, uint16_t insn)
{
  uint8_t  rd;
  uint32_t SP;
  // 1001 001d dddd 1111
  rd = ((insn >> 4) & 0x1f);

  HW_DMSG_DIS("%s r%d\n",OPCODES[opcode].name, rd);

  SP=SP_READ();
  MCU_RAM[ SP ] = MCU_REGS[rd];
  SP=SP - 1;
  SP_WRITE(SP);
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

/* TODO: Code review */
static int opcode_sbi(uint16_t opcode, uint16_t insn)
{
  uint8_t  aa, bb;
  int8_t   AA;
  
  // 1001 1010 AAAA Abbb
  aa = ((insn >> 3) & 0x1f);
  bb = (insn & 0x07);
  HW_DMSG_DIS("%s 0x%02x,b%d\n",OPCODES[opcode].name, aa, bb);

  AA = atmega128_io_read_byte(aa);
  atmega128_io_write_byte(aa, AA | (1<<bb));

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

/* TODO: Code review */
static int opcode_sec(uint16_t opcode, uint16_t insn)
{
  // 1001 0100 0000 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // set global interrupt flag
  SET_C;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}

/* TODO: Code review */
static int opcode_ses(uint16_t opcode, uint16_t insn)
{
  // 1001 0100 0100 1000
  HW_DMSG_DIS("%s\n",OPCODES[opcode].name);
  
  // set global interrupt flag
  SET_S;
  
  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(1);
  return opcode;
}
  
static int opcode_pop(uint16_t opcode, uint16_t insn)
{
  uint8_t  rd;
  uint32_t SP;
  // 1001 000d dddd 1111
  rd = ((insn >> 4) & 0x1f);

  HW_DMSG_DIS("%s r%d\n",OPCODES[opcode].name, rd);

  SP = SP_READ();
  MCU_REGS[rd] = MCU_RAM[ SP ] ;
  SP = SP + 1;
  SP_WRITE(SP);

  ADD_TO_PC(1); // PC is aligned on words
  SET_CYCLES(2);
  return opcode;
}

