afrab/WSim/arch/atmega/atmega128_alu.c
/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#if 0

LD [page 83]  Load Indirect from Data Space to Register using Index X
(i)    1001 000d dddd 1100    v0+v1
(ii)   1001 000d dddd 1101    v0+v1
(iii)  1001 000d dddd 1110    v0+v1

LDD [page 86]  Load Indirect from Data Space to Register using Index Y
(i)    1000 000d dddd 1000    v0+v1
(ii)   1001 000d dddd 1001    v0+v1
(iii)  1001 000d dddd 1010    v0+v1
(iiii) 10q0 qq0d dddd 1qqq    v0+v1

LDD [page 88]   Load Indirect From Data Space to Register using Index Z
(i)    1000 000d dddd 0000    v0+v1
(ii)   1001 000d dddd 0001    v0+v1
(iii)  1001 000d dddd 0010    v0+v1
(iiii) 10q0 qq0d dddd 0qqq    v0+v1

  -------------------------------------

ST [page 137] Store Indirect From Register to Data Space using Index X
(i)   1001 001r rrrr 1100   - -
(ii)  1001 001r rrrr 1101   - -
(iii) 1001 001r rrrr 1110   - -

STD [page 139]  Store Indirect From Register to Data Space using Index Y
(i)    1000 001r rrrr 1000  - -
(ii)   1001 001r rrrr 1001  - -
(iii)  1001 001r rrrr 1010  - -
(iiii) 10q0 qq1r rrrr 1qqq  - -

STD [page 142]  Store Indirect From Register to Data Space using Index Z
(i)    1000 001r rrrr 0000  - -
(ii)   1001 001r rrrr 0001  - -
(iii)  1001 001r rrrr 0010  - -
(iiii) 10q0 qq1r rrrr 0qqq  - -

#endif

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

void mcu_set_pc_next(uint16_t x)
{
  MCU_ALU.next_pc = x;
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

uint16_t mcu_get_pc(void)
{
  return MCU_ALU.pc;
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

uint16_t mcu_get_pc_next(void)
{
  return MCU_ALU.next_pc;
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

void atmega128_alu_reset(void)
{
  memset(MCU_RAM,0,MAX_RAM_SIZE);

  mcu_set_pc_next( MCU_BOOT_ADDRESS );
  SR = 0;

  MCU_ALU.interrupts = 0;
  MCU_ALU.signal     = 0;
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#define UNKNOWN_OPCODE(insn)						\
  do {									\
    ERROR("atmega:error: unknown opcode 0x%04x at 0x%04x\n",insn,mcu_get_pc()); \
    mcu_signal_add(SIG_MCU | SIG_MCU_ILL);				\
  } while (0)

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#define RETURN(opcode,insn)                                  \
  do {							     \
    return OPCODES[opcode].fun(opcode,insn);		     \
  } while (0)

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

static inline unsigned int extract_opcode(uint16_t insn)
{
  unsigned int tmp;

  tmp = (insn >> 12) & 0x0f; // 4 bits
  HW_DMSG_DIS("PC:0x%04x ins:0x%04x  ",(mcu_get_pc() & 0xffff) * 2,insn & 0xffff);

  switch (tmp)
    {
      /* ============================================================ */
      /* == 0000 BCD ================================================ */
      /* ============================================================ */
    case 0x0: 
      switch ((insn >> 10 ) & 0x3)
	{
	case 0x0: /* 0000 00xx CD */
	  switch ((insn >> 8) & 0x3)
	    {
	    case 0x0: /* 0000 0000 CD */
	      if (insn == 0) RETURN(OP_NOP,insn);
	      break;
	    case 0x1: /* 0000 0001 CD */ RETURN(OP_MOVW,insn);
	    case 0x2: /* 0000 0010 CD */ RETURN(OP_MULS,insn);
	    case 0x3: /* 0000 0011 0xxx 1xxx */
	      if      ((((insn >> 7) & 1) == 0) && (((insn >> 3) & 1) == 0))
		{
		  RETURN(OP_MULSU,insn);
		}    
	      else if ((((insn >> 7) & 1) == 0) && (((insn >> 3) & 1) == 1))
		{
		  RETURN(OP_FMUL,insn);
		}     /* 0000 0011 1xxx 0xxx */
	      else if ((((insn >> 7) & 1) == 1) && (((insn >> 3) & 1) == 0))
		{
		  RETURN(OP_FMULS,insn);
		}     /* 0000 0011 1xxx 1xxx */
	      else if ((((insn >> 7) & 1) == 1) && (((insn >> 3) & 1) == 1))
		{
		  RETURN(OP_FMULSU,insn);
		}
	      else
		{
		  UNKNOWN_OPCODE(insn); 
		}
	      break;
	    default:  UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	case 0x1: /* 0000 01xx CD */ RETURN(OP_CPC,insn);
	case 0x2: /* 0000 10xx CD */ RETURN(OP_SBC,insn);
	case 0x3: /* 0000 11xx CD */ RETURN(OP_ADD,insn); /* OP_LSL r=d */
	default: UNKNOWN_OPCODE(insn); break;
	}
      break;

      /* ============================================================ */
      /* == 0001 BCD ================================================ */
      /* ============================================================ */
    case 0x1:
      switch ((insn >> 10 ) & 0x3)
	{
	case 0x0: /* 0001 00xx CD */ RETURN(OP_CPSE,insn);
	case 0x1: /* 0001 01xx CD */ RETURN(OP_CP,insn);
	case 0x2: /* 0001 10xx CD */ RETURN(OP_SUB,insn);
	case 0x3: /* 0001 11xx CD */ RETURN(OP_ADC,insn); /* OP_ROL c=d */
	default: UNKNOWN_OPCODE(insn); break;
	}
      break;
      
      /* ============================================================ */
      /* == 0010 BCD ================================================ */
      /* ============================================================ */
    case 0x2: 
      switch ((insn >> 10 ) & 0x3)
	{
	case 0: /* 0010 00xx CD */ RETURN(OP_AND,insn); /* OP_TST if dst == src */
	case 1: /* 0010 01xx CD */ RETURN(OP_EOR,insn); /* OP_CLR if dst == src */
	case 2: /* 0010 10xx CD */ RETURN(OP_OR,insn);
	case 3: /* 0010 11xx CD */ RETURN(OP_MOV,insn);
	default: UNKNOWN_OPCODE(insn); break;
	}
      break;

