afrab/WSim/arch/atmega/atmega128_alu.c
      /* ============================================================ */
      /* == 0011 BCD ================================================ */
      /* ============================================================ */
    case 0x3: 
      RETURN(OP_CPI,insn);

      /* ============================================================ */
      /* == 0100 BCD ================================================ */
      /* ============================================================ */
    case 0x4:
      RETURN(OP_SBCI,insn);

      /* ============================================================ */
      /* == 0101 BCD ================================================ */
      /* ============================================================ */
    case 0x5:
      RETURN(OP_SUBI,insn);

      /* ============================================================ */
      /* == 0110 BCD ================================================ */
      /* ============================================================ */
    case 0x6: 
      RETURN(OP_ORI,insn);  /* OP_SBR */

      /* ============================================================ */
      /* == 0111 BCD ================================================ */
      /* ============================================================ */
    case 0x7:
      RETURN(OP_ANDI,insn);
      
      /* ============================================================ */
      /* == 1000 BCD ================================================ */
      /* ============================================================ */
    case 0x8:
      switch ((insn >> 8) & 0xf)
	{
	case 0x0: /* 1000 0000 CD */ 
	  switch (insn & 0xf)
	    {
	    case 0x0: /* 1000 0000 C 0000 */ RETURN(OP_LDD,insn);  /* LDD Z (i)   v0 */
	    case 0x8: /* 1000 0000 C 1000 */ RETURN(OP_LDD,insn);  /* LDD Y (i)   v0 */
	    default:  UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	case 0x1: /* 1000 0001 CD */ 
	  switch (insn & 0xf) 
	    {
	    case 0x0: /* 1000 0001 C 0000 */ RETURN(OP_LDD,insn);  /* LDD Z (i)   v1 */
	    case 0x8: /* 1000 0001 C 1000 */ RETURN(OP_LDD,insn);  /* LDD Y (i)   v1 */
	    default:  UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	case 0x2:
	  switch (insn & 0xf) 
	    {
	    case 0x0: /* 1000 0010 C 0000 */ RETURN(OP_STD,insn);  /* LDD Z (i)   v1 */
	    case 0x8: /* 1000 0010 C 1000 */ RETURN(OP_STD,insn);  /* LDD Y (i)   v1 */
	    default:  UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	case 0x3:
	  switch (insn & 0xf) 
	    {
	    case 0x0: /* 1000 0010 C 0000 */ RETURN(OP_STD,insn);  /* LDD Z (i)   v1 */
	    case 0x8: /* 1000 0010 C 1000 */ RETURN(OP_STD,insn);  /* LDD Y (i)   v1 */
	    default:  UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	default: 
	  if (BIT(insn,9) == 0)
	    {
	       if (BIT(insn,3) == 1)
		 RETURN(OP_LDD,insn);  /* LDD Y (iv)   v0 */
	       else
		 RETURN(OP_LDD,insn);  /* LDD Z (iv)   v0 */
	    }
	  else
	    {
	       if (BIT(insn,3) == 1)
		 RETURN(OP_STD,insn);  /* STD Y (iv)   v0 */
	       else
		 RETURN(OP_STD,insn);  /* STD Z (iv)   v0 */
	    }
	  break;
	}
      break;

      /* ============================================================ */
      /* == 1001 BCD ================================================ */
      /* ============================================================ */
    case 0x9: 
      switch ((insn >> 8) & 0xf)
	{
	case 0x0: /* 1001 0000 CD */
	  switch (insn & 0xf)
	    {
	    case 0x0: /* 1001 0000 C 0000 */ RETURN(OP_LDS,insn);  /* LDS         v0 */
	    case 0x1: /* 1001 0000 C 0001 */ RETURN(OP_LDD,insn);  /* LDD Z (ii)  v0 */
	    case 0x2: /* 1001 0000 C 0010 */ RETURN(OP_LDD,insn);  /* LDD Z (iii) v0 */
	    case 0x4: /* 1001 0000 C 0100 */ RETURN(OP_LPM,insn);  /* LPM   (ii)  v0 */
	    case 0x5: /* 1001 0000 C 0101 */ RETURN(OP_LPM,insn);  /* LPM   (iii) v0 */
	    case 0x6: /* 1001 0000 C 0110 */ RETURN(OP_ELPM,insn); /* ELPM  (ii)  v0 */
	    case 0x7: /* 1001 0000 C 0111 */ RETURN(OP_ELPM,insn); /* ELPM  (iii) v0 */ 
	    case 0x8: /* 1001 0000 C 1001 */ RETURN(OP_LDD,insn);  /* LDD Y (ii)  v0 */
	    case 0xa: /* 1001 0000 C 1010 */ RETURN(OP_LDD,insn);  /* LDD Y (iii) v0 */
	    case 0xc: /* 1001 0000 C 1100 */ RETURN(OP_LD,insn);   /* LD    (i)   v0 */
	    case 0xd: /* 1001 0000 C 1101 */ RETURN(OP_LD,insn);   /* LD    (ii)  v0 */
	    case 0xe: /* 1001 0000 C 1110 */ RETURN(OP_LD,insn);   /* LD    (iii) v0 */
	    case 0xf: /* 1001 0000 C 1111 */ RETURN(OP_POP,insn);  /* POP         v0 */
	    default:  UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	case 0x1: /* 1001 0001 CD */
	  switch (insn & 0xf)
	    {
	    case 0x0: /* 1001 0001 C 0000 */ RETURN(OP_LDS,insn);  /* LDS         v1 */
	    case 0x1: /* 1001 0001 C 0001 */ RETURN(OP_LDD,insn);  /* LDD Z (ii)  v1 */
	    case 0x2: /* 1001 0001 C 0010 */ RETURN(OP_LDD,insn);  /* LDD Z (iii) v1 */
	    case 0x4: /* 1001 0001 C 0100 */ RETURN(OP_LPM,insn);  /* LPM   (ii)  v1 */
	    case 0x5: /* 1001 0001 C 0101 */ RETURN(OP_LPM,insn);  /* LPM   (iii) v1 */
	    case 0x6: /* 1001 0001 C 0110 */ RETURN(OP_ELPM,insn); /* ELPM  (ii)  v1 */
	    case 0x7: /* 1001 0001 C 0111 */ RETURN(OP_ELPM,insn); /* ELPM  (iii) v1 */
	    case 0x8: /* 1001 0001 C 1001 */ RETURN(OP_LDD,insn);  /* LDD Y (ii)  v1 */
	    case 0xa: /* 1001 0001 C 1010 */ RETURN(OP_LDD,insn);  /* LDD Y (iii) v1 */
	    case 0xc: /* 1001 0001 C 1100 */ RETURN(OP_LD,insn);   /* LD    (i)   v1 */
	    case 0xd: /* 1001 0001 C 1101 */ RETURN(OP_LD,insn);   /* LD    (ii)  v1 */
	    case 0xe: /* 1001 0001 C 1110 */ RETURN(OP_LD,insn);   /* LD    (iii) v1 */
	    case 0xf: /* 1001 0001 C 1111 */ RETURN(OP_POP,insn);  /* POP         v1 */
	    default:  UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	case 0x2: /* 1001 0010 CD */
	  switch (insn & 0xf)
	    {
	    case 0x0: /* 1001 0010 C 0000 */ RETURN(OP_STS,insn);  /* v0 */
	    case 0x1: /* 1001 0010 C 0001 */ RETURN(OP_STD,insn);  /* STD Z */ 
	    case 0x2: /* 1001 0010 C 0010 */ RETURN(OP_STD,insn);  /* STD Z */ 
	    case 0x8: /* 1001 0010 C 1000 */ RETURN(OP_STD,insn);  /* STD Y */ 
	    case 0xa: /* 1001 0010 C 1010 */ RETURN(OP_STD,insn);  /* STD Y */ 
	    case 0xc: /* 1001 0010 C 1100 */ RETURN(OP_ST,insn);   /* v0 */
	    case 0xd: /* 1001 0010 C 1101 */ RETURN(OP_ST,insn);   /* v0 */
	    case 0xe: /* 1001 0010 C 1110 */ RETURN(OP_ST,insn);   /* v0 */
	    case 0xf: /* 1001 001C C 1111 */ RETURN(OP_PUSH,insn); 
	    default:  UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	case 0x3: /* 1001 0011 CD */
	  switch (insn & 0xf)
	    {
	    case 0x0: /* 1001 0011 C 0000 */ RETURN(OP_STS,insn);  /* v1 */
	    case 0x1: /* 1001 0011 C 0001 */ RETURN(OP_STD,insn);  /* STD Z */ 
	    case 0x2: /* 1001 0011 C 0010 */ RETURN(OP_STD,insn);  /* STD Z */ 
	    case 0x8: /* 1001 0011 C 1000 */ RETURN(OP_STD,insn);  /* STD Y */ 
	    case 0xa: /* 1001 0011 C 1010 */ RETURN(OP_STD,insn);  /* STD Y */ 
	    case 0xc: /* 1001 0011 C 1100 */ RETURN(OP_ST,insn);   /* v1 */
	    case 0xd: /* 1001 0011 C 1101 */ RETURN(OP_ST,insn);   /* v1 */
	    case 0xe: /* 1001 0011 C 1110 */ RETURN(OP_ST,insn);   /* v1 */
	    case 0xf: /* 1001 001C C 1111 */ RETURN(OP_PUSH,insn);
	    default:  UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	case 0x4: /* 1001 0100 CD */ 
	  switch (insn & 0xf)
	    {
	    case 0x0: /* 1001 0100 C 0000 */ RETURN(OP_COM,insn);
	    case 0x1: /* 1001 0100 C 0001 */ RETURN(OP_NEG,insn);
	    case 0x2: /* 1001 0100 C 0010 */ RETURN(OP_SWAP,insn);
	    case 0x3: /* 1001 0100 C 0011 */ RETURN(OP_INC,insn);
	    case 0x5: /* 1001 0100 C 0101 */ RETURN(OP_ASR,insn);
	    case 0x6: /* 1001 0100 C 0110 */ RETURN(OP_LSR,insn);
	    case 0x7: /* 1001 0100 C 0111 */ RETURN(OP_ROR,insn);
	    case 0x8: /* 1001 0100 C 1000 */ 
	      switch ((insn >> 4) & 0xf)
		{
		  /* ** 0xxx return OP_BSET ** */
		case 0x0: RETURN(OP_SEC,insn);    /* 0000 fall */
		case 0x1: RETURN(OP_SEZ,insn);    /* 0001 fall */
		case 0x2: RETURN(OP_SEN,insn);    /* 0010 fall */
		case 0x3: RETURN(OP_SEV,insn);    /* 0011 fall */
		case 0x4: RETURN(OP_SES,insn);    /* 0100 fall */
		case 0x5: RETURN(OP_SEH,insn);    /* 0101 fall */
		case 0x6: RETURN(OP_SET,insn);    /* 0110 fall */
		case 0x7: RETURN(OP_SEI,insn);    /* 0111 = BSET */
		  
		  /* ** 1xxx RETURN(OP_BCLR,insn); ** */
		case 0x8: RETURN(OP_CLC,insn);    /* 1000 */
		case 0x9: RETURN(OP_CLZ,insn);    /* 1001 */
		case 0xa: RETURN(OP_CLN,insn);    /* 1010 */
		case 0xb: RETURN(OP_CLV,insn);    /* 1011 */
		case 0xc: RETURN(OP_CLS,insn);    /* 1100 */
		case 0xd: RETURN(OP_CLH,insn);    /* 1101 */
		case 0xe: RETURN(OP_CLT,insn);    /* 1110 */
		case 0xf: RETURN(OP_CLI,insn);    /* 1111 */
		}
	      break;
	    case 0x9: /* 1001 0100 C 1001 */
	      switch ((insn >> 4) & 0xf)
		{
		case 0x0: RETURN(OP_IJMP,insn);   /* 0000 */
		case 0x1: RETURN(OP_EIJMP,insn);  /* 0001 */
		default:  UNKNOWN_OPCODE(insn); break;
		}
	      break;
	    case 0xa: /* 1001 0100 C 1010 */ RETURN(OP_DEC,insn);
	    case 0xc: /* 1001 0100 C 1100 */ /* fall */
	    case 0xd: /* 1001 0100 C 1101 */ RETURN(OP_JMP,insn);
	    case 0xe: /* 1001 0100 C 1110 */ /* fall */
	    case 0xf: /* 1001 0100 C 1111 */ RETURN(OP_CALL,insn);
	    default: UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	case 0x5: /* 1001 0101 CD */
	  switch (insn & 0xf)
	    {
	    case 0x0: /* 1001 0101 C 0000 */ RETURN(OP_COM,insn);
	    case 0x1: /* 1001 0100 C 0001 */ RETURN(OP_NEG,insn);
	    case 0x2: /* 1001 0100 C 0010 */ RETURN(OP_SWAP,insn);
	    case 0x3: /* 1001 0101 C 0011 */ RETURN(OP_INC,insn);
	    case 0x5: /* 1001 0101 C 0101 */ RETURN(OP_ASR,insn);
	    case 0x6: /* 1001 0101 C 0110 */ RETURN(OP_LSR,insn);
	    case 0x7: /* 1001 0101 C 0111 */ RETURN(OP_ROR,insn);
	    case 0x8: /* 1001 0101 C 1000 */ 
	      switch ((insn >> 4) & 0xf)
		{
		case 0x0: RETURN(OP_RET,insn);    /* 0000 */
		case 0x1: RETURN(OP_RETI,insn);   /* 0001 */
		case 0x8: RETURN(OP_SLEEP,insn);  /* 1000 */
		case 0x9: RETURN(OP_BREAK,insn);  /* 1001 */
		case 0xa: RETURN(OP_WDR,insn);    /* 1010 */
		case 0xc: RETURN(OP_LPM,insn);    /* 1100 */ /* LPM (i)  */
		case 0xd: RETURN(OP_ELPM,insn);   /* 1101 */ /* ELPM (i) */
		case 0xe: RETURN(OP_SPM,insn);    /* 1110 */
		default : UNKNOWN_OPCODE(insn); break;
		}
	      break;
	    case 0x9: /* 1001 0101 C 1001 */ 
	      switch ((insn >> 4) & 0xf)
		{
		case 0x0: RETURN(OP_ICALL,insn);  /* 0000 */
		case 0x1: RETURN(OP_EICALL,insn); /* 0001 */
		default:  UNKNOWN_OPCODE(insn); break;
		}
	      break;
	    case 0xa: /* 1001 0101 C 1010 */ RETURN(OP_DEC,insn);
	    case 0xc: /* 1001 0101 C 1100 */ /* fall */
	    case 0xd: /* 1001 0101 C 1101 */ RETURN(OP_JMP,insn);
	    case 0xe: /* 1001 0101 C 1110 */ /* fall */
	    case 0xf: /* 1001 0101 C 1111 */ RETURN(OP_CALL,insn);
	    default:  UNKNOWN_OPCODE(insn); break;
	    }
	  break;
	case 0x6: /* 1001 0110 CD */ RETURN(OP_ADIW,insn);
	case 0x7: /* 1001 0111 CD */ RETURN(OP_SBIW,insn);
	case 0x8: /* 1001 1000 CD */ RETURN(OP_CBI,insn);
	case 0x9: /* 1001 1001 CD */ RETURN(OP_SBIC,insn);
	case 0xa: /* 1001 1010 CD */ RETURN(OP_SBI,insn);
	case 0xb: /* 1001 1011 CD */ RETURN(OP_SBIS,insn);
	case 0xc: /* 1001 1100 CD */ /* fall */
	case 0xd: /* 1001 1101 CD */ /* fall */
	case 0xe: /* 1001 1110 CD */ /* fall */
	case 0xf: /* 1001 11xx CD */ RETURN(OP_MUL,insn);
	default: UNKNOWN_OPCODE(insn); break;
	}
      break;

