afrab/WSim/arch/atmega/atmega128_alu.c
      /* ============================================================ */
      /* == 1010 BCD ================================================ */
      /* ============================================================ */
    case 0xa:
      if (BIT(insn,9) == 0)
	{
	  if (BIT(insn,3) == 1)
	    RETURN(OP_LDD,insn);  /* LDD Y (iv)   v1  */
	  else
	    RETURN(OP_LDD,insn);  /* LDD Z (iv)   v1 */
	}
      else
	{
	  if (BIT(insn,3) == 1)
	    RETURN(OP_STD,insn);  /* STD Y (iv)   v1 */
	  else
	    RETURN(OP_STD,insn);  /* STD Z (iv)   v1 */
	}
      break;

      /* ============================================================ */
      /* == 1011 BCD ================================================ */
      /* ============================================================ */
    case 0xb:
      if (((insn >> 11) & 1) == 0)
	{
	  RETURN(OP_IN,insn);
	}
      else
	{
	  RETURN(OP_OUT,insn);
	}
      break;

      /* ============================================================ */
      /* == 1100 BCD ================================================ */
      /* ============================================================ */
    case 0xc:
      RETURN(OP_RJMP,insn);

      /* ============================================================ */
      /* == 1101 BCD ================================================ */
      /* ============================================================ */
    case 0xd:
      RETURN(OP_RCALL,insn);

      /* ============================================================ */
      /* == 1110 BCD ================================================ */
      /* ============================================================ */
    case 0xe:
      RETURN(OP_LDI,insn); /* = OP_SER */

      /* ============================================================ */
      /* == 1111 BCD ================================================ */
      /* ============================================================ */
    case 0xf: 
      switch ((insn >> 9) & 0x7) /* 3b */
	{
	case 0x0: /* 1111 000x CD */ /* fall */
	case 0x1: /* 1111 001x CD */ 
	  switch (insn & 0x7)
	    {
	    case 0x0: RETURN(OP_BRCS,insn); /* BRLO */
	    case 0x1: RETURN(OP_BREQ,insn);
	    case 0x2: RETURN(OP_BRMI,insn);
	    case 0x3: RETURN(OP_BRVS,insn);
	    case 0x4: RETURN(OP_BRLT,insn);
	    case 0x5: RETURN(OP_BRHS,insn);
	    case 0x6: RETURN(OP_BRTS,insn);
	    case 0x7: RETURN(OP_BRIE,insn);
	    default:  RETURN(OP_BRBS,insn);
	    }
	  break;
	case 0x2: /* 1111 010x CD */ /* fall */
	case 0x3: /* 1111 011x CD */ 
	  switch (insn & 0x7)
	    {
	    case 0x0: RETURN(OP_BRCC,insn); /* BRSH */
	    case 0x1: RETURN(OP_BRNE,insn);
	    case 0x2: RETURN(OP_BRPL,insn);
	    case 0x3: RETURN(OP_BRVC,insn);
	    case 0x4: RETURN(OP_BRGE,insn);
	    case 0x5: RETURN(OP_BRHC,insn);
	    case 0x6: RETURN(OP_BRTC,insn);
	    case 0x7: RETURN(OP_BRID,insn);
	    default:  RETURN(OP_BRBC,insn);
	    }
	  break;
	case 0x4: /* 1111 100x CD */ RETURN(OP_BLD,insn);
	case 0x5: /* 1111 101x CD */ 
	  if (BIT(insn,3) == 0)
	    RETURN(OP_BST,insn);
	  else
	    UNKNOWN_OPCODE(insn);
	  break;
	case 0x6: /* 1111 110x CD */
	  if (BIT(insn,3) == 0)
	    RETURN(OP_SBRC,insn);
	  else
	    UNKNOWN_OPCODE(insn);
	  break;
	case 0x7: /* 1111 111x CD */
	  if (BIT(insn,3) == 0)
	    RETURN(OP_SBRS,insn);
	  else
	    UNKNOWN_OPCODE(insn);
	  break;
	default: UNKNOWN_OPCODE(insn); break;
	}
      break;

      /* ============================================================ */
      /* ============================================================ */
      /* ============================================================ */
    default: UNKNOWN_OPCODE(insn); break;
    }
  return 0;
}

/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/

static void atmega128_mcu_update(unsigned int UNUSED cycles)
{
  /* time update from cycles     */
  /* internal devices update (1) */
  /* external devices update     */
  /* internal devices update (2) */
}

/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/

static void atmega128_mcu_run_insn(void)
{
  do 
    {
      uint16_t insn       = 0;
      unsigned int opcode = 0;
      unsigned int cycles = 0;

      MCU_ALU.pc = MCU_ALU.next_pc;
      insn = atmega128_flash_read_short(MCU_ALU.pc << 1);
      opcode = extract_opcode(insn);
      MCU_INSN_CPT  += 1;
#if defined(ETRACE)
      /* eslot */
#endif
      atmega128_mcu_update(cycles);
    }
  while (MCU_ALU.signal == 0);
}

/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/

static void atmega128_mcu_run_lpm(void)
{
#define LPM_UPDATE_CYCLES 2
  do {
    atmega128_mcu_update(LPM_UPDATE_CYCLES);
  } while (MCU_ALU.signal == 0);
}

/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/

void mcu_run(void)
{
  int curr_run_mode;
  int prev_run_mode;

  curr_run_mode = RUNNING_MODE(); 
  //MCU_CLOCK_SYSTEM_SPEED_TRACER(); 

  do {
    if (1==1) /* current run mode == active */ 
      {
	HW_DMSG_FD("----------------------------------------------\n");
	atmega128_mcu_run_insn();
	HW_DMSG_FD("\n");
      }
    else
      {
	atmega128_mcu_run_lpm();
      }

    prev_run_mode = curr_run_mode; 
    curr_run_mode = RUNNING_MODE();

    /*
     * update rmode after a couple of instructions
     */
    if (MCU_ALU.signal & SIG_MCU_LPM_CHANGE)
      {
	HW_DMSG_LPM("atmega128:lpm: Low power mode [%s] changed to [%s] at [%" PRId64 "]\n",
		    atmega128_lpm_names[prev_run_mode],          
		    atmega128_lpm_names[curr_run_mode], 
		    MACHINE_TIME_GET_NANO());
	//TRACER_TRACE_LPM(curr_run_mode);
	//MCU_CLOCK_SYSTEM_SPEED_TRACER();
	MCU_ALU.signal &= ~SIG_MCU_LPM_CHANGE; 
	
	if (((prev_run_mode & 1) == 0) && ((curr_run_mode & 1) != 0))
	  {
	    etracer_slot_set_ns();
	  }
	
      }

  } while (MCU_ALU.signal == 0);

}

/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/
